In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import math
import numpy as np
from numpy.random import randn 
np.random.seed(10)

In [2]:
mdf = pd.DataFrame(randn(6,3), columns="A B C".split())

In [3]:
mdf

          A         B         C
0  1.331587  0.715279 -1.545400
1 -0.008384  0.621336 -0.720086
2  0.265512  0.108549  0.004291
3 -0.174600  0.433026  1.203037
4 -0.965066  1.028274  0.228630
5  0.445138 -1.136602  0.135137

In [11]:
mdf.index = pd.MultiIndex(
    levels=[["Almaty", "Astana"],
            ["Kids","Male","Female"]],
    labels = [[0,0,0,1,1,1],[0,1,2,0,1,2]])

In [12]:
mdf

                      A         B         C
Almaty Kids    1.331587  0.715279 -1.545400
       Male   -0.008384  0.621336 -0.720086
       Female  0.265512  0.108549  0.004291
Astana Kids   -0.174600  0.433026  1.203037
       Male   -0.965066  1.028274  0.228630
       Female  0.445138 -1.136602  0.135137

In [20]:
mdf.loc["Almaty"]
mdf.index.names = ["City", "Sex"]

In [21]:
mdf.loc["Almaty"].loc["Male"]

A   -0.008384
B    0.621336
C   -0.720086
Name: Male, dtype: float64

In [22]:
mdf.xs(["Almaty","Male"])

A   -0.008384
B    0.621336
C   -0.720086
Name: (Almaty, Male), dtype: float64

In [25]:
mdf.xs("Male", level="Sex")

               A         B         C
City
Almaty -0.008384  0.621336 -0.720086
Astana -0.965066  1.028274  0.228630

In [30]:
df = pd.DataFrame({"A": [1,2,3], "B": [np.nan, np.nan, 1], "C": [1, np.nan, 2]})
df

   A    B    C
0  1  NaN  1.0
1  2  NaN  NaN
2  3  1.0  2.0

In [31]:
df.dropna()

   A    B    C
2  3  1.0  2.0

In [32]:
df.dropna(thresh=2)

   A    B    C
0  1  NaN  1.0
2  3  1.0  2.0

In [38]:
df.fillna(value=0)

   A    B    C
0  1  0.0  1.0
1  2  0.0  0.0
2  3  1.0  2.0

In [39]:
df["B"] = df["B"].fillna(value=df["B"].mean())
df

   A    B    C
0  1  1.0  1.0
1  2  1.0  NaN
2  3  1.0  2.0

In [40]:
for col in df.columns:
    df[col] = df[col].fillna(value=df[col].mean())

In [41]:
df

   A    B    C
0  1  1.0  1.0
1  2  1.0  1.5
2  3  1.0  2.0

In [42]:
data = {
    "Company": ["GOOG", "GOOG", "MSFT", "MSFT", "FB", "FB"],
    "Person": ["Sam", "Charlie", "Amy", "Vanessa", "Carl", "Sarah"],
    "Sales": [200, 120, 340, 124, 243, 350]
}

In [43]:
df = pd.DataFrame(data)

In [44]:
df.head(3)

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340

In [47]:
df.groupby("Company").mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [46]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [48]:
df.groupby("Company").min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [49]:
df.groupby("Company").count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [50]:
df.groupby("Company").describe().T

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000